In [2]:
import pandas as pd

In [ ]:
s = pd.Series([1, 2, 3, 4, 5])
type(s)
s1 = pd.Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])

pandas.Series

In [5]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [3]:
data = [[1, 444, 'abc'], 
        [2, 555, 'def'],
        [3, 666, 'ghi'],
        [4, 444, 'xyz']]


df = pd.DataFrame(data, columns=['ID', 'std_id', 'Dept'])
df

   ID  std_id Dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     444  xyz

In [ ]:

data_2 = {'ID': [1, 2, 3, 4],
          'std_id_dict': [444, 555, 666, 444],
          'Dept': ['abc', 'def', 'ghi', 'xyz']} 


df = pd.DataFrame(data_2)
df

   ID  std_id_dict Dept
0   1          444  abc
1   2          555  def
2   3          666  ghi
3   4          444  xyz

In [ ]:
df.columns

Index(['ID', 'std_id', 'Dept'], dtype='str')

In [ ]:
index = ['row1', 'row2', 'row3', 'row4']
df.index = index
display(df) 

# prioroty: object , string , float , int

      ID  std_id Dept
row1   1     444  abc
row2   2     555  def
row3   3     666  ghi
row4   4     444  xyz

In [14]:
df.dtypes

ID        int64
std_id    int64
Dept        str
dtype: object

In [16]:
class person:
    def __init__(self, name):
        self.name = name
    @property
    def getInfo(self):
        return self.name

p1 = person("Samuel")
print(p1.getInfo)

Samuel

In [17]:
df['Dept'].dtype

In [18]:
df['Dept'] = df['Dept'].astype('category')

In [19]:
df['Dept'].dtype

CategoricalDtype(categories=['abc', 'def', 'ghi', 'xyz'], ordered=False, categories_dtype=str)

In [23]:
df.head(2)

      ID  std_id Dept
row1   1     444  abc
row2   2     555  def

In [22]:
df.tail(1)

      ID  std_id Dept
row4   4     444  xyz

In [24]:
df.describe()

             ID      std_id
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [25]:
df.describe(include='category')

       Dept
count     4
unique    4
top     abc
freq      1

In [26]:
df.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='str')

In [30]:
df['std_id'].unique()

array([444, 555, 666])

In [ ]:
x = df['std_id'].unique().sum()
x

np.int64(1665)

In [32]:
df['std_id'].max()

np.int64(666)

In [33]:
df.Dept.idxmax()

'row4'

In [34]:
df.Dept.idxmin()

'row1'

In [35]:
df.info()

<class 'pandas.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4 non-null      int64
 1   std_id  4 non-null      int64
 2   Dept    4 non-null      category
dtypes: category(1), int64(2)
memory usage: 476.0+ bytes

In [36]:
df['Dept'].value_counts()

Dept
abc    1
def    1
ghi    1
xyz    1
Name: count, dtype: int64

In [37]:
df['ID'].sum()

np.int64(10)

In [38]:
def duplicate(x):
    return x * 2

df['std_id'].apply(duplicate)

row1     888
row2    1110
row3    1332
row4     888
Name: std_id, dtype: int64

In [ ]:
# same as above using lambda function
df['std_id'].apply(lambda x: x * 2)

row1     888
row2    1110
row3    1332
row4     888
Name: std_id, dtype: int64

In [40]:
df['ID'].iloc[2]

np.int64(3)

In [42]:
df.iloc[2, 1]

np.int64(666)

In [44]:
df.Dept.iloc[0:2]

row1    abc
row2    def
Name: Dept, dtype: category
Categories (4, str): ['abc', 'def', 'ghi', 'xyz']

In [45]:
df.iloc[:]

      ID  std_id Dept
row1   1     444  abc
row2   2     555  def
row3   3     666  ghi
row4   4     444  xyz

In [47]:
df.iloc[:, 0:2]

      ID  std_id
row1   1     444
row2   2     555
row3   3     666
row4   4     444

In [49]:
target_y = df.iloc[:, :-1]
target_y

      ID  std_id
row1   1     444
row2   2     555
row3   3     666
row4   4     444

In [53]:
df['new_col'] = df['std_id'] + df['ID']
df

      ID  std_id Dept  new_col
row1   1     444  abc      445
row2   2     555  def      557
row3   3     666  ghi      669
row4   4     444  xyz      448

In [ ]:
df.drop('new_col', axis=1, inplace=True)
df

      ID  std_id Dept
row1   1     444  abc
row2   2     555  def
row3   3     666  ghi
row4   4     444  xyz

In [56]:
df.isnull().sum()

ID        0
std_id    0
Dept      0
dtype: int64

In [57]:
import numpy as np

In [ ]:
def isNull(df):
   null = df.isnull().sum()
   return pd.DataFrame(null).T

In [58]:
null = df.isnull().sum()
pd.DataFrame(null).T

   ID  std_id  Dept
0   0       0     0

In [4]:
from isnullval import isNull
isNull(df)

   ID  std_id  Dept
0   0       0     0